Revit 2027 API
ThermalAsset.VaporPressure Property
 The vapor pressure of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VaporPressure { get; set; }
Public Property VaporPressure As Double
	Get
	Set
public:
property double VaporPressure {
	double get ();
	void set (double value);
}
member VaporPressure : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for vaporPressure must be non-negative.
Remarks
 Values are in kilograms per feet, squared-second (kg/(ft · s²)) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace